{
  "URL": "https://therecipecritic.com/20-minute-vegetable-lo-mein/",
  "Summary": "20-minute Vegetable Lo Mein is a super easy weeknight dish loaded with fresh, stir-fried veggies! With crisp vegetables and tender egg noodles all combined in a savory sauce, this is a knockout recipe that the whole family will go crazy over!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  15minutes",
    "Total Time:  20minutes",
    "Servings:  4servings"
  ],
  "Ingredients": [
    "8 ounces uncooked lo mein noodles or spaghetti",
    "1 tablespoon vegetable oil",
    "1 red bell pepper, julienned",
    "1 medium carrot, julienned",
    "½ cup snow peas",
    "1 cup button mushrooms,  cut in half or quartered",
    "1 cup broccoli florets, bite-size",
    "3 cloves garlic, minced",
    "½-1 cup bean sprouts",
    "sesame seeds for garnish, if desired",
    "3 tablespoons soy sauce, regular or low sodium",
    "1 tablespoon hoisin sauce",
    "1 teaspoon sesame oil",
    "1 teaspoon brown sugar",
    "1 tablespoon mirin, or rice vinegar",
    "1 clove garlic, minced",
    "1 teaspoon fresh ginger,  minced"
  ],
  "Instructions": [
    "Bring a large pot of water to a boil and cook the 8 ounces uncooked lo mein noodles or spaghetti according to package instructions. Strain and set aside.",
    "Heat 1 tablespoon vegetable oil over medium-high heat in a large skillet.",
    "Add 1 red bell pepper, 1 medium carrot, ½ cup snow peas, 1 cup button mushrooms,  1 cup broccoli florets, in all the vegetables except the bean sprouts. Sauté until tender, about 5 minutes.",
    "Add in 3 cloves garlic, and cook for an additional minute.",
    "Stir in the sauce, cooked noodles, and ½-1 cup bean sprouts and toss to combine. Cook for 2-3 minutes, until the noodles are heated through.",
    "Top with a sprinkle of sesame seeds for garnish, if desired, and serve immediately.",
    "In a small bowl whisk together 3 tablespoons soy sauce, 1 tablespoon hoisin sauce, 1 teaspoon sesame oil, 1 teaspoon brown sugar, 1 tablespoon mirin, 1 clove garlic, and 1 teaspoon fresh ginger,  and set aside until needed."
  ],
  "Nutrition": [
    "Calories: 299kcal",
    "Carbohydrates: 54g",
    "Protein: 9g",
    "Fat: 6g",
    "Saturated Fat: 1g",
    "Polyunsaturated Fat: 3g",
    "Monounsaturated Fat: 1g",
    "Trans Fat: 0.02g",
    "Cholesterol: 0.1mg",
    "Sodium: 1046mg",
    "Potassium: 352mg",
    "Fiber: 4g",
    "Sugar: 7g",
    "Vitamin A: 3757IU",
    "Vitamin C: 70mg",
    "Calcium: 36mg",
    "Iron: 1mg",
    ""
  ],
  "Comments": [
    "Leslie Fry says:1 teaspoon of sesame oil over powered the entire dish, I would use 1/2 teaspoon of sesame oil next time and I think it will be good.",
    "Sandra says:This is a go to recipe for my family! I love the combination of veggies, the deliciousness of the sauce, and the ease of the preparation.Just make it an enjoy it.",
    "Karen McKelley says:I look so forward to your recipes. They are truly amazing. Please keep them coming!",
    "joker188 says:thx for information",
    "Bandar Togel Terpercaya says:Pretty cool post. It’s really very nice and useful post, Thanks",
    "Lisa bella says:Im so Interested in more recipes! They look so amazing",
    "Wynonah Bates says:Do you have a recommended brand of lo mein noodles?",
    "Alyssa Rivers says:I really like any kind that is at our local grocery store.",
    "Laura macaloney says:Does it say “lo Mein” on the package?",
    "Amy says:I am so going to make this for dinner tonight! Yum! I can’t wait!",
    "Joanie Bolduc-Dionne says:I’ve now made this recipe too many times to count and live it!",
    "Kate says:Really yummy recipe. Make a whole meal by adding tofu and eggs!",
    "Kumar vishwas Pagli ladki says:Wow that looks delicious, thanks for the recipe.",
    "Stephanie Reyes says:Interested in more recipes! They look amaxing",
    "Alisa t says:This is vegetarian right ?"
  ]
}