{
  "URL": "https://therecipecritic.com/20-minute-garlic-beef-and-broccoli-lo-mein/",
  "Summary": "20 Minute Garlic Beef and Broccoli Lo Mein has melt in your mouth tender beef with broccoli, carrots, and noodles. The sauce adds such amazing flavor to this incredibly easy meal!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  15minutes",
    "Total Time:  20minutes",
    "Servings:  4People"
  ],
  "Ingredients": [
    "8 ounces lo mein noodles or spaghetti noodles",
    "3 cups broccoli florets",
    "1 tablespoon olive oil",
    "8 ounce flank steak sliced against the grain",
    "3 garlic cloves minced",
    "1 medium carrot shredded",
    "¼ cup packed brown sugar",
    "¼ cup reduced-sodium soy sauce",
    "2 tablespoons hoisin sauce",
    "2 teaspoons sesame oil",
    "¼ teaspoon ground ginger",
    "¼ teaspoon crushed red pepper flakes",
    "¼ teaspoon pepper",
    "green onion for garnish",
    "sesame seeds for garnish"
  ],
  "Instructions": [
    "In a large pot with boiling water, cook the noodles according to package directions. Add the broccoli the last 5 minutes of cooking and let them cook until tender. Drain the noodles and broccoli.",
    "Cut the flank steak across the grain in 1/4 inch strips.",
    "While the pasta is cooking, add olive oil to a medium sized skillet. Cook the steak until no longer pink.",
    "Add the garlic, and carrots and cook for a minute more.",
    "In a small bowl whisk together the brown sugar soy sauce, hoisin sauce, sesame oil, ginger, red pepper and pepper.",
    "Add the spaghetti to the skillet and pour the sauce on top and toss until incorporated.",
    "Garnish with chopped green onion and sesame seeds if desired."
  ],
  "Nutrition": [
    "Calories: 407kcal",
    "Carbohydrates: 61g",
    "Protein: 20g",
    "Fat: 10g",
    "Saturated Fat: 2g",
    "Cholesterol: 34mg",
    "Sodium: 760mg",
    "Potassium: 465mg",
    "Fiber: 3g",
    "Sugar: 15g",
    "Vitamin A: 425IU",
    "Vitamin C: 61.5mg",
    "Calcium: 62mg",
    "Iron: 1.8mg"
  ],
  "Comments": [
    "JILL PETERSON says:This recipe was very good. I used Odom moo that came precooked so I added the broccoli to the meat to make this in one pot",
    "Leslie C says:My whole family – including 2 picky teen boy eaters enjoyed this recipe.  I added some red peppers as well for an extra veggie.  Doubled it all.  This will go into our family rotation.  Thank you for a great recipe.",
    "Girl mom says:I’ve been thinking for a while that I wished I could get Beef and Broccoli and Low Mein in the same dish, so I finally decided to look for recipes, and this was the first one that pulled up.  It was so, so good!  It was a similar texture to the low mein you find in Chinese restaurants, with the delicious and rich beef and broccoli sauce.  I think you could add any veggies you wanted and it would be great, and you could totally add a meat substitute to please a plant based crowd.",
    "Martiey says:This was great! I cut it down to one serving, skipped the carrots (I don’t like them) and replaced the chili flakes with Momofuku Chili Crunch. Going into my regular rotation!",
    "Holly says:This recipe has become a family favorite. My father is not fond of rice but I love beef and broccoli. So in hopes that with noodles he would eat this, I tried it.BIG success.I cook the broccoli softer and the meat is sliced thinner for my older father, otherwise recipe is followed exactly. No need to change anything.Dad is cautious about my internet recipes, they are not always as good as they sound. But this recipe is truly a winner!",
    "Sammy says:Way too much hoisin sauce and brown sugar. It needs to be saltier."
  ]
}