{
  "URL": "https://therecipecritic.com/20-minute-italian-bread-twists/",
  "Summary": "Homemade breadtwists have all the delicious buttery, garlic flavor of your favorite restaurant-quality breadsticks, but now they are unbelievably easy to make at home!  The smell that fills your home will make you want to eat them straight out of the oven!",
  "Metadata": [
    "Prep Time:  20minutes",
    "Cook Time:  25minutes",
    "Proofing:  1hour",
    "Total Time:    1hour45minutes",
    "Servings:  15Breadsticks"
  ],
  "Ingredients": [
    "1 ½ cups warm water",
    "1 tablespoon granulated sugar",
    "1 packet instant dry yeast",
    "3-4 cups all-purpose flour",
    "1 ½ teaspoons salt",
    "½ cup salted butter melted",
    "2 teaspoons garlic powder",
    "2 teaspoons dried oregano",
    "2 teaspoons dried basil",
    "1 teaspoon salt",
    "½ cup grated parmesan cheese the kind from the bottle"
  ],
  "Instructions": [
    "Add 1 ½ cups warm water,1 tablespoon granulated sugar, 1 packet instant dry yeast, 3-4 cups all-purpose flour, and 1 ½ teaspoons salt to the bowl of a stand mixer fitted with the dough hook attachment.",
    "Mix on medium-low speed for a few minutes, until the dough starts coming together. If the dough seems wet, add more flour, 1-2 tablespoons at a time, until the dough begins to come together and pull away from the sides of the bowl.",
    "Once the dough has formed and has the desired texture, increase speed to medium-high and mix for at least 5 minutes to develop the gluten.",
    "Add the dough to a lightly oiled bowl and cover. Let the dough rest for about an hour or until it has doubled in size.",
    "Preheat an oven to 375 degrees Fahrenheit, and prepare a baking sheet by lining it with parchment paper.",
    "Dump the risen dough out onto a lightly floured surface and roll it into a large rectangle, about 12×24 inches.",
    "Melt ½ cup salted butter in a microwaveable safe dish. Add 2 teaspoons garlic powder, 2 teaspoons dried oregano, 2 teaspoons dried basil, and 1 teaspoon salt to the butter.",
    "Brush half of the butter mixture onto the slab of dough, and sprinkle half of the ½ cup grated parmesan cheese on the buttered slab.",
    "Fold the buttered dough slab in half hamburger-style, brush the remaining butter mixture onto the top of the slab, and sprinkle the remaining cheese on top of that.",
    "Use a knife or pizza cutter to cut the slab into strips from folded end to open end in about 1-inch strips, I got 12 strips.",
    "Pick up the strips of dough one at a time and twist them, lay the twisted strips onto the prepared baking sheet, and continue with the rest of the dough.",
    "When the twists are ready, bake them in the preheated oven for 20-25 minutes until they’re golden brown.",
    "Remove from the oven and let them cool for at least 5 minutes before serving."
  ],
  "Nutrition": [
    "Calories: 165kcal",
    "Carbohydrates: 21g",
    "Protein: 4g",
    "Fat: 7g",
    "Saturated Fat: 4g",
    "Polyunsaturated Fat: 0.4g",
    "Monounsaturated Fat: 2g",
    "Trans Fat: 0.2g",
    "Cholesterol: 19mg",
    "Sodium: 497mg",
    "Potassium: 47mg",
    "Fiber: 1g",
    "Sugar: 1g",
    "Vitamin A: 223IU",
    "Vitamin C: 0.01mg",
    "Calcium: 44mg",
    "Iron: 1mg",
    ""
  ],
  "Comments": [
    "Verena says:Once the dough has been twisted, do you let it rise again or does it get baked straight away?",
    "Alyssa Rivers says:Once they have been twisted they can get baked straight away!",
    "Glenda says:Does it matter what type of yeast I use? I have instant and regular-does it matter?",
    "Denice says:Do I need to bake these right away or can I put them in the fridge after I prepare them?",
    "Alyssa Rivers says:You can store the uncooked dough in your refrigerator for up to 48 hour before baking the breadtwists.",
    "Mari says:I’ve been making these for quite awhile now. They are so quick and easy. Great with a variety of soups and pasta dishes. Best part is that I don’t need to plan my day around them. They slide right into my dinner prep time.My family loves these, and they’re spoiled with homemade bread being common in our home. Great recipe. Thanks."
  ]
}