{
  "URL": "https://therecipecritic.com/20-minute-skillet-blackened-shrimp-fajitas/",
  "Summary": "20 Minute Skillet Blackened Shrimp Fajitas are such an easy and flavorful meal packed with blackened shrimp, peppers and onion. This classic meal is perfect served up in tortillas with avocado and chopped cilantro!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  15minutes",
    "Total Time:  20minutes",
    "Servings:  4servings"
  ],
  "Ingredients": [
    "1 pound peeled and deveined large shrimp",
    "1 tablespoon chili powder",
    "2 teaspoons paprika",
    "1 teaspoon onion powder",
    "1 teaspoon cumin",
    "½ teaspoon garlic powder",
    "1 teaspoon salt",
    "¼ teaspoon pepper",
    "2 tablespoons olive oil divided",
    "1 sliced red bell pepper",
    "1 sliced green bell pepper",
    "1 sliced yellow bell pepper",
    "1 medium sliced onion",
    "avocado chopped cilantro, sour cream optional garnish"
  ],
  "Instructions": [
    "In a large bowl, add the shrimp, chili powder, paprika, onion powder, cumin, garlic powder, and salt and pepper. Set aside.",
    "In a medium-sized skillet over medium high heat, add 1 tablespoon olive oil and the sliced bell peppers and onion. Saute until tender about 5-7 minutes. Slide the cooked vegetables to the side of the skillet.",
    "Add the remaining 1 tablespoon olive oil and add the seasoned shrimp. Cook for 2-3 minutes or until pink.",
    "Serve in tortillas with optional toppings."
  ],
  "Nutrition": [
    "Calories: 108kcal",
    "Carbohydrates: 10g",
    "Protein: 2g",
    "Fat: 8g",
    "Saturated Fat: 1g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 5g",
    "Sodium: 620mg",
    "Potassium: 300mg",
    "Fiber: 3g",
    "Sugar: 3g",
    "Vitamin A: 2194IU",
    "Vitamin C: 119mg",
    "Calcium: 31mg",
    "Iron: 1mg",
    ""
  ],
  "Comments": [
    "ayla Khan says:Very Yummy Recipe. I ll try it for sure.",
    "Oscars 2021 live says:It was really best blog..",
    "JP says:Made this in the air fryer with frozen shrimp and fresh veggies.  Delicious!!!",
    "Sam says:Thanks for sharing this amazing post. World’s best assignment experts by your choice to make it better in educational carrier. Students often miss the assignment deadlines, due to this they score less marks in coursework. This is the moment QuickAssignmenthelp is considered to be the best companion of a student in need of online assignment help. We are here to help you in your assignments with plagiarism free contents  and also provides  the plagiarism report asked by the students. We also provides online tutoring if there is any doubts in assignments for exam viva-voice.Network Security assignment help by expert tutors at affordable price.",
    "Tejar says:Tejar is Pakistan’s top e-commerce store that deals in genuine and reliable consumer goods belonging to numerous brands and product categories",
    "Sam says:It was really best blog. Thanking for sharing the blog which helps me more to understand. Get assignment help by expert and qualified tutors online for all course quickly from Quick Assignment help.Data Mining assignment help by expert professional at low price. To make grade high in course work, it is necessary to complete assignment according to instruction provided by professor. Get high content at quick assignment help with no plagiarism contents.",
    "Sam says:It was really best blog. Thanking for sharing the blog which helps me more to understand. Get assignment help by expert and qualified tutors online for all course quickly from Quick Assignment help.Sociology assignment help by expert professional at low price. To make grade high in course work, it is necessary to complete assignment according to instruction provided by professor. Get high content at quick assignment help with no plagiarism contents.",
    "Sam says:It is really helpful for reader and from which reader got solution of question from this blog. Thank you for sharing valuable information.",
    "alibaba says:I am so hungry",
    "Deb says:Grilled the veggies in a grill pan till smokin hot and a bit charred. Added shrimp. And warmed tortilla on the grill. So good.",
    "Hd TV izle says:These will definitely be on our dinner rotation from now on!Thank you!",
    "CINDY REISINGER says:Yes quite easy and delicious. We will make again.",
    "Javier says:Super easy, super delicious recipe!!!!!",
    "Annette says:Any specific brand of chili powder?",
    "Alyssa Rivers says:Annette!Any brand should work just great!  Thanks for following along with me!",
    "Cheryl Brandmuelller says:This was so good.  A little on the “warm” side, but we like that.I did remove tails with shell before cooking shrimp.",
    "Punam Paul says:I just finished enjoying this recipe. Wonderful taste and easy to prepare."
  ]
}