{
  "URL": "https://therecipecritic.com/3-ingredient-pumpkin-chocolate-chip-cookies/",
  "Summary": "Why complicate cookies when 3 ingredients will do the trick? These little guys are soft, sweet, pumpkin-spiced, and perfect for fall!",
  "Metadata": [
    "Prep Time:  10minutes",
    "Cook Time:  15minutes",
    "Total Time:  25minutes",
    "Servings:  12cookies"
  ],
  "Ingredients": [
    "1 (15-ounce) can pumpkin puree",
    "1 (15.25-ounce) box spice cake mix",
    "1 cup milk chocolate chips"
  ],
  "Instructions": [
    "Preheat the oven to 350 degrees Fahrenheit. Line 2 baking sheets with parchment paper.",
    "Now, in a large bowl, let's keep it simple. Just mix the 1 (15-ounce) can pumpkin puree and 1 (15.25-ounce) box spice cake mix until they're fully combined. Then, stir in 1 cup milk chocolate chips. It's that easy!",
    "Use a medium cookie scoop to scoop the dough, about 2 ½ tablespoons per cookie, onto the prepared baking sheets, leaving about 2 inches between them.",
    "Bake for 13-15 minutes, until the edges of the cookies are set and begin to turn golden brown. Remove them from the oven and allow them to cool on the baking sheet for 5 minutes before transferring them to a cooling rack to finish cooling."
  ],
  "Nutrition": [
    "Calories: 264kcal",
    "Carbohydrates: 42g",
    "Protein: 3g",
    "Fat: 9g",
    "Saturated Fat: 4g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 3g",
    "Trans Fat: 0.03g",
    "Cholesterol: 2mg",
    "Sodium: 293mg",
    "Potassium: 147mg",
    "Fiber: 1g",
    "Sugar: 29g",
    "Vitamin A: 48IU",
    "Vitamin C: 0.2mg",
    "Calcium: 58mg",
    "Iron: 2mg",
    ""
  ],
  "Comments": [
    "Aubrey M says:Love this easy recipe, I doubled it because of the 12 per batch label and let me tell you, I’ve made 34 so far and only used half the batter so maybe see how far you get with a single recipe unless youneed a lot, but they’ll definitely get eaten regardless.",
    "Wendy says:We love these!  Especially perfect because they don’t contain eggs as our grandson has a severe egg allergy.  Yum! ?",
    "Brittany says:Are you nutrition facts for the entire batch?",
    "Alyssa Rivers says:Per cookie!",
    "Jasa says:Yeeks",
    "Wendy says:I made these exactly as directed and we thought they were awful… we threw them away."
  ]
}