{
  "URL": "https://therecipecritic.com/3-packet-chicken/",
  "Summary": "3 Packet Crockpot Chicken takes just 5 minutes to prep and comes out juicy, tender, and full of flavor.",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  4hours",
    "Total Time:    4hours5minutes",
    "Servings:  6people"
  ],
  "Ingredients": [
    "3 pounds boneless skinless chicken breasts",
    "1 (1-ounce) packet ranch seasoning powder",
    "1 (0.6-ounce) packet Italian dressing powder",
    "1 (0.9-ounce) packet chicken gravy powder",
    "1 cup low sodium chicken broth or water"
  ],
  "Instructions": [
    "Spray the inside of the slow cooker with non-stick cooking spray. Place 3 pounds boneless skinless chicken breasts in the bottom of the slow cooker.",
    "In a medium-sized bowl combine 1 cup low sodium chicken broth, 1 (1-ounce) packet ranch seasoning powder, 1 (0.6-ounce) packet Italian dressing powder, and 1 (0.9-ounce) packet chicken gravy powder. Whisk together until dissolved.",
    "Pour the broth mixture over the chicken in the slow cooker.",
    "Cover and cook on LOW for 5 hours or HIGH for 4 hours.",
    "Shred the chicken using two forks and serve with mashed potatoes or rice!"
  ],
  "Nutrition": [
    "Calories: 266kcal",
    "Carbohydrates: 1g",
    "Protein: 49g",
    "Fat: 6g",
    "Saturated Fat: 1g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 2g",
    "Trans Fat: 0.03g",
    "Cholesterol: 145mg",
    "Sodium: 306mg",
    "Potassium: 873mg",
    "Sugar: 0.1g",
    "Vitamin A: 69IU",
    "Vitamin C: 3mg",
    "Calcium: 13mg",
    "Iron: 1mg"
  ],
  "Comments": [
    "Jen says:Can I use frozen chicken breasts in this recipe?",
    "Alyssa Rivers says:Yes, that should work just fine! You might need to add more cooking time, just check them after 5 hours.",
    "Stacey Gray says:If I can’t find Italian seasoning dry mix can I use the salad dressing? And adjust the liquid?",
    "Alyssa Rivers says:That should work Stacey, or you can make my Italian dressing mix recipe and use 2-3 tablespoons of that in place of the packet.",
    "Ashley says:I loved this recipe and how easy it was to make, but my husband and one of my boys thought it was a little too salty. Any suggestions on how best to cut back on sodium besides use low sodium broth?",
    "Alyssa Rivers says:There are low sodium options out there for the gravy and onion soup packets, and you could make your own ranch seasoning and just leave out the salt.Another option is using half of each packet. I tried this once with the 3 packet roast and it was plenty of flavor, so it would probably still work for the chicken! I hope this helps!",
    "L walsh says:This was so easy and not too salty which was a concern. My only add was some black pepper to taste. Juicy and went well with mashed potatoes and some steamed veggies. I came across this recipe because The Stay At Home Chef shared it today 4/16/25",
    "Alyssa Rivers says:I’m so glad you tried it and liked it! Thank you for letting me know Rachel posted my recipe! I love her! She has some amazing recipes as well!"
  ]
}