{
  "URL": "https://therecipecritic.com/3-packet-roast/",
  "Summary": "This 3 packet roast is my go-to for an easy but delicious Sunday dinner. Add brown gravy, Italian dressing, and ranch dressing powders to a slow cooker with your beef and then let it work its magic! It creates an ultra-tender, flavorful roast you’ll love coming home to at the end of the day.",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  8hours",
    "Total Time:    8hours5minutes",
    "Servings:  6people"
  ],
  "Ingredients": [
    "3-4 pounds boneless rump roast",
    "1 packet ranch seasoning powder",
    "1 packet Italian dressing powder",
    "1 packet brown gravy powder",
    "1 cup low sodium beef broth, or water"
  ],
  "Instructions": [
    "Place the 3-4 pounds boneless rump roast in the bottom of the slow cooker.",
    "Add 1 cup low sodium beef broth, or water to a small bowl. Pour in 1 packet ranch seasoning powder, 1 packet Italian dressing powder, and 1 packet brown gravy powder. Whisk together until the powders are dissolved.",
    "Pour the mixture over the roast into the slow cooker.",
    "Cover and cook on low for 8 hours or 4-5 hours on high.",
    "Shred and serve with mashed potatoes and roasted vegetables!"
  ],
  "Nutrition": [
    "Calories: 321kcal",
    "Carbohydrates: 0.2g",
    "Protein: 51g",
    "Fat: 11g",
    "Saturated Fat: 4g",
    "Polyunsaturated Fat: 0.5g",
    "Monounsaturated Fat: 5g",
    "Cholesterol: 141mg",
    "Sodium: 231mg",
    "Potassium: 853mg",
    "Sugar: 0.01g",
    "Calcium: 43mg",
    "Iron: 5mg",
    ""
  ],
  "Comments": [
    "Eileen Lee says:When do you make the slurry and add it in?",
    "Alyssa Rivers says:You can find the instructions at the bottom of the post in the recipe card. But here are the instructions as well.1. Place the 3-4 pounds boneless rump roast in the bottom of the slow cooker.2. Add beef broth, or water to a small bowl. Pour in 1 packet ranch seasoning powder, 1 packet Italian dressing powder, and 1 packet brown gravy powder. Whisk together until the powders are dissolved.3. Pour the mixture over the roast into the slow cooker.4. Cover and cook on low for 8 hours or 4-5 hours on high.5. Shred and serve with mashed potatoes and roasted vegetables!",
    "KJ Smith says:This is so delicious and so easy, I almost feel like I’m cheating!  I slice a medium onion and put it in the bottom of the crock pot, then put the roast on top.  I also add red potatoes and baby carrots about halfway through.  I just scrub the taters, cut them in about 2 inch cubes and leave the skin on (that’s where all the nutrients are!)  Mashed potatoes are great too, but for a one pot meal it’s super easy to just stick onions, carrots and taters in there.  Then I steam something green, (Green beans, spinach, broccolli, whatever you like!) and some bread or rolls.  So easy Sooooooo YUMMY!",
    "Cheryl Bosch says:Have you tried this with a pork loin roast and do you think it would be as good?",
    "Alyssa Rivers says:Hi Cheryl, I haven’t tried it with pork, but I bet it would be amazing! Always be sure your meet is cooked through before eating! Let me know how it turns out!",
    "Edita says:Can I substitute the Italian dressing mix with liptons onion soup mix?",
    "Alyssa Rivers says:It will bring a totally different flavor but you can try it!",
    "Maggie says:If I wanted to make this a complete meal and add red potatoes and carrots,  when should I add them in the slow cooking process so that the potatoes are cooked thru and the carrots not mushy?",
    "Jen says:Can you use pork roast for this recipe?",
    "Alyssa Rivers says:Yes you can!",
    "Cathy says:Sadly, the sodium count is off by a factor of ten.The nutrition information on the 3 packets indicates a total of 13,280 mg of sodium just for them, which divided by six servings is 2213 mg per serving.Almost all of the sodium is in the Italian dressing packet, so substituting homemade for that would make this doable from a sodium perspective.Alyssa, I love your recipes, but maybe you should redo this nutritional information.",
    "Tia Martschuk says:Could you use a bottle of Italian dressing in place of the packet (and just adjust the stock liquid?). I couldn’t find the Italian packet here in Canada but I really want to try this recipe.",
    "Alyssa Rivers says:Yes, I think that would work great!!",
    "Gil says:Does it freeze well?",
    "Alyssa Rivers says:Yes! I recommend freezing in individual portions.",
    "Dan Bell says:Always great recipes and thankyou for doing what you do. Most appreciated.",
    "M. Vastine says:I’ve been making this crock pot roast for years.  Definitely comes out better with low sodium brown gravy mix.  I also add fresh onions and garlic, and serve with mashed potatoes.  Great comfort food.",
    "Charlene Lyle says:I copy so many of your recipes, I have to check my files each time to make sure I don’t already have it befoe I add it again!  I always make sure I have your name under the title because I know without trying it that I can use it for company and it will be delicious!",
    "Gregory says:I was able to try this weekend. My kids loved it. I was wondering if I could add carrots, potatoes and celery to the crockpot while beef is cooking?",
    "Alyssa Rivers says:Yes, it would turn out great!",
    "Mary Maxwell says:Been cooking this for several years.  Don’t have to use a rump roast, though.  I use chuck roast. And yes, carrots, potatoes, onions are great additions.",
    "Shery Sullivan says:Sounds so so tasty. Can’t wait to try",
    "Lisa N. says:Thanks for this recipe, Alyssa.  One question….I have always browned my red meat. Before putting it in the slow cooker.  You didn’t mention doing this…does the roast brown well even without browning it ahead of time?",
    "Alyssa Rivers says:I always just add it in as-is and it turns out great, but feel free to brown it beforehand if you prefer!",
    "Jackie says:I have always seared a roast before cooking it, regardless of the method, as it does produce a more flavorful & tender roast. Sure, it takes a few more minutes & an extra pan but the payoff is certainly worth it. And, you can also sear your onions & carrots, too, if you so choose to add them!",
    "LInda says:While easy and oh so yummy it has way to much sodium for a lot of us.",
    "Dottie says:You could make this with very little sodium if you used recipes for the ranch mix and Italian salad dressing mix and leave out the salt. Then, use water instead of broth like the recipe mentions, and you’ll only have the sodium from the gravy mix!  I can’t wait to try it!",
    "Jackie says:Great suggestion Dottie, because nowadays there are so many options for low sodium ingredients. Almost anything can be made with simple substitutions.",
    "Jackie says:Upon further reading, a serving is only 231mg which is considered to be extremely low. In fact, it’s only 9.58% of your daily suggested intake of 2300 mg. Hope this information helps!",
    "Irma says:Yes! I made it tonight and it is super salty. I even used low sodium products.",
    "Donna Donna says:Hello everyoneMy husband has been on a restricted sodium diet for a few years now, and we try to keep the count to no more than 1500 mg of sodium per day, we have found using good quality lower sodium products helps keep us on track. At the count of 231mg per serving, I would not consider this a high sodium meal. The dietician at the Heart Inst. recommended to us to aim for about 400 to 450mg per meal. He was allowed the 2300mg, it was us that decided to try and limit it to the 1500mg per day."
  ]
}