{
  "URL": "https://therecipecritic.com/30-minute-asiago-cheese-rolls/",
  "Summary": "These rolls are made with quick and easy dough and are ready in 30 minutes! With delicious Asiago Cheese on top of these soft and perfect rolls, they are sure to be a hit!",
  "Metadata": [
    "Prep Time:  30minutes",
    "Cook Time:  12minutes",
    "Total Time:  42minutes",
    "Servings:  12Rolls"
  ],
  "Ingredients": [
    "1 ½ cups warm water",
    "2 tablespoons granulated sugar",
    "1 tablespoon instant yeast, or rapid rise yeast",
    "3 ½ cups all-purpose flour",
    "1 teaspoon salt",
    "1 egg, for egg wash",
    "1 tablespoon milk, for egg wash",
    "4 ounces shredded Asiago cheese"
  ],
  "Instructions": [
    "Preheat the oven to 400 degrees Fahrenheit and line a baking sheet with parchment paper.",
    "In a large bowl combine 1 ½ cups warm water, 2 tablespoons granulated sugars, and 1 tablespoon instant yeast, Set it aside in a warm place for 5 minutes, until the yeast is frothy.",
    "Add 3 ½ cups all-purpose flour and 1 teaspoon salt  to the water mixture. Use a stand mixer fitted with the dough hook to knead everything until smooth, about 5 minutes.  Cover the bowl with plastic wrap and set it aside again to rise for 10 minutes. I",
    "Divide the dough into 12 equal portions. Roll each piece of dough into a ball and place them on the prepared baking sheet. Let rest for 10 minutes.",
    "Whisk 1 egg, and 1 tablespoon milk, in a small bowl. Brush it onto the tops of each roll before sprinkling them evenly with 4 ounces shredded Asiago cheese. Bake for 12-15 minutes or until golden brown."
  ],
  "Nutrition": [
    "Calories: 185kcal",
    "Carbohydrates: 30g",
    "Protein: 8g",
    "Fat: 3g",
    "Saturated Fat: 2g",
    "Polyunsaturated Fat: 0.3g",
    "Monounsaturated Fat: 1g",
    "Trans Fat: 0.002g",
    "Cholesterol: 20mg",
    "Sodium: 353mg",
    "Potassium: 58mg",
    "Fiber: 1g",
    "Sugar: 2g",
    "Vitamin A: 96IU",
    "Vitamin C: 0.001mg",
    "Calcium: 122mg",
    "Iron: 2mg",
    ""
  ],
  "Comments": [
    "Jen M says:I made these last night and the dough was very runny and stickyand not able to form into roll shape. They came out like flat disks, not fluffy rolls. What could have gone wrong?",
    "Sharon says:Can you mix it by hand if you don’t have a Kitchen Aid mixer with dough hook or is that a deal breaker?",
    "Eva says:What kind of yeast??",
    "Alyssa Rivers says:Dry active yeast!"
  ]
}