{
  "URL": "https://therecipecritic.com/4-ingredient-churro-fudge/",
  "Summary": "All the sweet, cinnamon-sugar magic of churros turned into smooth, melt-in-your-mouth fudge. Only 4 ingredients and ready in minutes!",
  "Metadata": [
    "Prep Time:  10minutes",
    "chill time:  2hours",
    "Total Time:    2hours10minutes",
    "Servings:  16servings"
  ],
  "Ingredients": [
    "3 cups high-quality white chocolate chips or chunks",
    "1 (14-ounce) can sweetened condensed milk",
    "2 tablespoons salted butter",
    "7 tablespoons cinnamon sugar divided"
  ],
  "Instructions": [
    "Lightly spray an 8 x 8-inch baking pan with nonstick cooking spray and line the pan with parchment paper, leaving a 1-2 inch overhang on either side. Set aside.",
    "Add 3 cups high-quality white chocolate chips, 1 (14-ounce) can sweetened condensed milk, and 2 tablespoons salted butter to a medium saucepan and heat over medium-low heat, stirring constantly until fully melted and very smooth, about 4 minutes.",
    "Remove from the heat and stir 4 tablespoons of the 7 tablespoons cinnamon sugar into the fudge mixture.",
    "Pour the fudge mixture into the prepared baking pan and smooth over the top. Spoon the remaining 3 tablespoons of cinnamon sugar evenly over the top, then swirl it into the fudge with a knife.",
    "Cover the pan with aluminum foil or plastic wrap and chill in the refrigerator for at least 2 hours, or until solid."
  ],
  "Nutrition": [
    "Calories: 246kcal",
    "Carbohydrates: 33g",
    "Protein: 3g",
    "Fat: 12g",
    "Saturated Fat: 7g",
    "Polyunsaturated Fat: 0.4g",
    "Monounsaturated Fat: 3g",
    "Trans Fat: 0.1g",
    "Cholesterol: 17mg",
    "Sodium: 65mg",
    "Potassium: 163mg",
    "Fiber: 0.05g",
    "Sugar: 33g",
    "Vitamin A: 117IU",
    "Vitamin C: 1mg",
    "Calcium: 120mg",
    "Iron: 0.1mg",
    ""
  ],
  "Comments": [
    "LuAnn says:Can this recipe be doubled for a 13×9 baking pan??",
    "Alyssa Rivers says:Hmm, I think it’ll end up being a bit thin in a 9×13 pan being doubled. I would suggest doing 2.5 or 3x in order to fill a 9×13 and have enough to make good pieces of fudge. But if you’re okay with thinner pieces, then doubling it would work!",
    "Sherry says:What is the ratio of cinnamon and sugar please?",
    "Alyssa Rivers says:You can make your own cinnamon sugar by mixing ½ cup granulated sugar with 2 tablespoons ground cinnamon."
  ]
}