{
  "URL": "https://therecipecritic.com/5-ingredient-corn-casserole/",
  "Summary": "This five-ingredient cornbread casserole can be prepped and ready to go in the oven in less than five minutes. It's packed with sweet, juicy corn and fluffy cornbread and tastes amazing! You can make this side dish for the holidays, to go with your favorite chili or any weeknight dinner. ",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  45minutes",
    "Total Time:  50minutes",
    "Servings:  8People"
  ],
  "Ingredients": [
    "8 ounce box Jiffy Corn Muffin Mix",
    "15 ounce whole kernel corn, drained",
    "15 ounce creamed corn, not drained",
    "1 cup sour cream",
    "1/2 cup unsalted butter, melted"
  ],
  "Instructions": [
    "Preheat the oven to 350 degrees Fahrenheit.  Spray an 8×8-inch baking pan with non-stick cooking spray.",
    "In a large bowl, add 8 ounce box Jiffy Corn Muffin Mix, 15 ounce whole kernel corn,, 15 ounce creamed corn, 1 cup sour cream, and melted 1/2 cup unsalted butter,. Stir together until combined.",
    "Pour into the prepared pan.",
    "Bake uncovered for 45-55 minutes or until lightly browned.",
    "Serve warm and enjoy!"
  ],
  "Nutrition": [
    "Calories: 133kcal",
    "Carbohydrates: 17g",
    "Protein: 3g",
    "Fat: 7g",
    "Saturated Fat: 3g",
    "Cholesterol: 15mg",
    "Sodium: 261mg",
    "Potassium: 173mg",
    "Fiber: 1g",
    "Sugar: 3g",
    "Vitamin A: 220IU",
    "Vitamin C: 3.6mg",
    "Calcium: 33mg",
    "Iron: 0.4mg"
  ],
  "Comments": [
    "Deb U says:Just a question – what’s the green stuff you sprinkle over at the end –  Parsley, Cilantro, ???Thanks this looks delicious. Can’t wait to try it.",
    "Alyssa Rivers says:Those are sliced green onions!",
    "Fay says:I’d never had Corn Casserole before, so I just did a test run to get ready for Thanksgiving. It’s very good and I’ve added it to the holiday menu. Thanks!",
    "Lisa Mills says:I’ve made this several times now and it’s a new family favorite! Your cookbook is my favorite and I have made so many dishes in the book. Each one has come out great! I’m ready for your next cookbook.",
    "Gail says:What can you use in corn casserole dish to replace the sour cream?",
    "Alyssa Rivers says:Hi Gail, you can use greek yogurt instead of sour cream. In the future, you can visit my ingredient substitution page if you ever have questions or need to replace common ingredients.",
    "Kat says:My 23 yr old son LOVED this recipe. I’m known for making new recipes constantly and complains that I make so many good things but he only sees them once. He told me I need to make this again. ?"
  ]
}