{
  "URL": "https://therecipecritic.com/5-minute-million-dollar-dip/",
  "Summary": "This quick and easy Million Dollar Dip (Neiman Marcus Dip) is the ultimate party favorite! Made in minutes with bacon, cheddar, mayo, and almonds!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Total Time:  5minutes",
    "Servings:  12people"
  ],
  "Ingredients": [
    "1 ½ cups mayonnaise",
    "8 ounces shredded cheddar cheese",
    "5 chopped green onions",
    "½ cup real bacon bits",
    "½ cup slivered almonds"
  ],
  "Instructions": [
    "In a medium bowl, add 1 ½ cups mayonnaise, 8 ounces shredded cheddar cheese, 5 chopped green onions, ½ cup real bacon bits, and ½ cup slivered almonds. Mix until combined.",
    "Cover and chill for at least 2 hours.",
    "Serve with your favorite crackers!"
  ],
  "Nutrition": [
    "Calories: 312kcal",
    "Carbohydrates: 2g",
    "Protein: 8g",
    "Fat: 31g",
    "Saturated Fat: 8g",
    "Polyunsaturated Fat: 13g",
    "Monounsaturated Fat: 8g",
    "Trans Fat: 0.1g",
    "Cholesterol: 37mg",
    "Sodium: 443mg",
    "Potassium: 67mg",
    "Fiber: 1g",
    "Sugar: 1g",
    "Vitamin A: 257IU",
    "Vitamin C: 1mg",
    "Calcium: 152mg",
    "Iron: 0.3mg",
    ""
  ],
  "Comments": [
    "Christine says:Thank you❣️",
    "Val says:This looks great, but I tend to like sour cream more than mayo in dips. Do you think this would work if I used half sour cream and half mayo?",
    "Alyssa Rivers says:Sour cream will work in place of the mayo, it will just add a little bit more tang to the dip.",
    "Patricia Andrade says:I will be trying this out this weekend",
    "Beckie says:What a lovely person you are . Raising 4 children ,working tiresly to perfect recipes. Just found your recipe today and hope to find more. Many blessings to you and your family",
    "Alyssa Rivers says:Thanks for making me feel seen Beckie! I really appreciate your comment! Many blessings to you and yours as well!",
    "B J says:Can leftovers be frozen?",
    "Alyssa Rivers says:No, I don’t suggest freezing this dip. The mayonnaise in it will separate and become watery if frozen and thawed.",
    "Mary Garcia says:I made the marry me chicken pasta it was great. Loved it. Thank you. Looking for easy meatless dishes.",
    "Amanda says:Made this and it was ok, nothing spectacular, I thought it was really salty! I believe the culprit was the bacon bits. If I make this again I will use real bacon instead.",
    "Diana says:We make this every year in triple batches for our holiday gathering and always gone. Passed along to lots of peeps. Love it",
    "Alyssa Rivers says:It’s so simple but so good! Thanks for sharing!",
    "Karen says:I think you forgot the cream cheese!",
    "Alyssa Rivers says:Hi Karen, this recipe doesn’t call for cream cheese. If you are looking for a similar flavor but with cream cheese you should try my baked bacon dip!"
  ]
}