{
  "URL": "https://therecipecritic.com/air-fryer-cauliflower-wings/",
  "Summary": "This low-carb take on wings is going to rock your world! Draped in a sticky-sweet honey buffalo sauce, these easy air fryer cauliflower wings are absolutely to die for!",
  "Metadata": [
    "Prep Time:  10minutes",
    "Cook Time:  12minutes",
    "Total Time:  22minutes",
    "Servings:  4people"
  ],
  "Ingredients": [
    "1 head cauliflower",
    "2 cups flour",
    "1 teaspoon paprika",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon onion powder",
    "1/4 teaspoon chili powder",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "optional: pinch red pepper flakes",
    "2 1/2 cups milk",
    "1/2 cup Franks Buffalo Sauce",
    "1/2 cup honey",
    "2 Tablespoons Brown Sugar"
  ],
  "Instructions": [
    "Cut the cauliflower in half and then cut into florets. In a medium-sized bowl add the flour, paprika, garlic powder, onion powder, chili powder, salt, pepper and red pepper flakes. Add the milk and mix until combined.",
    "Dip each floret into the batter and remove excess by shaking with a fork. Place in an even layer in the basket of the air fryer.",
    "Cook at 380 degrees for 10-12 minutes. While cooking makes the honey Buffalo sauce by combining buffalo sauce, honey, and brown sugar.",
    "Toss the cauliflower wings in the sauce and coat evenly. Serve with ranch, celery, and carrots if desired."
  ],
  "Nutrition": [
    "Calories: 512kcal",
    "Carbohydrates: 104g",
    "Protein: 14g",
    "Fat: 6g",
    "Saturated Fat: 3g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 1g",
    "Cholesterol: 15mg",
    "Sodium: 407mg",
    "Potassium: 750mg",
    "Fiber: 5g",
    "Sugar: 51g",
    "Vitamin A: 531IU",
    "Vitamin C: 70mg",
    "Calcium: 224mg",
    "Iron: 4mg"
  ],
  "Comments": [
    "Kasey says:I really want to make this, but are the amounts correct for the flour and milk? That’s an awful lot of each, so I just wanted to make sure. I know for the regular buffalo cauliflower it’s only 1/2 cup each. I wasn’t sure if there was a difference. Thanks (:",
    "Rosemarie says:Definitely way too much batter! The consistency was good, but it made a lot. We did two batches of cauliflower, two sweet potatoes, and still had some remaining."
  ]
}