{
  "URL": "https://therecipecritic.com/air-fryer-brussel-sprouts/",
  "Summary": "Crispy Parmesan Air Fryer Brussels Sprouts are super easy, packed with flavor and have tasty golden crunch. This is going to be one of the best ways to get your kids to say \"More Please!\" when it comes to their veggies. These are just that good!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  10minutes",
    "Total Time:  15minutes",
    "Servings:  4People"
  ],
  "Ingredients": [
    "½ pound Brussels sprouts cut in half",
    "1 tablespoon olive oil",
    "salt and pepper to taste",
    "½ cup grated parmesan cheese",
    "2 tablespoons panko bread crumbs",
    "1 tablespoon Italian seasoning"
  ],
  "Instructions": [
    "In a medium-sized bowl combine ½ pound Brussels sprouts, 1 tablespoon olive oil, and salt and pepper.",
    "In a small bowl combine ½ cup grated parmesan cheese, 2 tablespoons panko bread crumbs, and 1 tablespoon Italian seasoning. Sprinkle half of the mixture on the Brussels sprouts and toss.",
    "Add the Brussels sprouts in an even layer in the basket of your air fryer.  Cook the Brussels sprouts at 390 degrees Fahrenheit for 5 minutes.  Open the air fryer and toss the Brussels sprouts with the rest of the topping.  Cook for an additional 5 minutes or until golden brown and tender."
  ],
  "Nutrition": [
    "Calories: 131kcal",
    "Carbohydrates: 11g",
    "Protein: 6g",
    "Fat: 7g",
    "Saturated Fat: 3g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 3g",
    "Cholesterol: 11mg",
    "Sodium: 270mg",
    "Potassium: 269mg",
    "Fiber: 3g",
    "Sugar: 2g",
    "Vitamin A: 557IU",
    "Vitamin C: 48mg",
    "Calcium: 163mg",
    "Iron: 2mg"
  ],
  "Comments": [
    "Donna Dravis says:Really Great recipe. I used frozen brussel sprouts so need longer cooking time.",
    "Sharon says:Can I use frozen Brussel sprouts?",
    "Alyssa Rivers says:Yes but I would make sure to let them thaw first or else the seasonings won’t stick to them.",
    "Joanne Kraemer says:My husband has been a bit quirky about Brussel Sprouts.  At Christmas I had oven roasted with olive oil, balsamic vinegar and turkey bacon.  These passed the palate test.  But this new Garlic / Parmesan cream sauce has taken “Sprouts” to a you can again recipe. Sobey’s  new product line “Panache” has a Parmigiano Reggiano – it’s roughly half the cost of the “from Italy region” product and when used for the cream sauce for the sprouts was great.  Normally, I am a fussy cook and I want the real product. The taste on it’s own or thrown into a soup, sauce or salad was great. If I was serving to a food critic maybe I would break the bank.",
    "Sutton Bennett says:Where is the recipe for this “cream sauce” you are talking about?  I am making the brussels right now but no sauce.",
    "Sandy says:Can’t wait to try this.  Can this be done on a sheet & roasted in the oven?",
    "Marlene says:Hi Sandy…that’s the way, I’ve always prepared them in the oven, until I found this recipe.",
    "Gwen says:I love brussel sprouts prepared many ways, even raw, and this is one of my favorite recipes. Even my husband who swore he hates them asked for me to make these more often. Thanks for a great recipe, yum!"
  ]
}