{
  "URL": "https://therecipecritic.com/air-fryer-butternut-squash/",
  "Summary": "This easy air fryer butternut squash is tender and savory and makes the BEST side dish to any meal! Seasoned with delicious spices the air fryer cooks this squash to perfection.",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  20minutes",
    "Total Time:  25minutes",
    "Servings: 8"
  ],
  "Ingredients": [
    "4 cups butternut squash, peeled and cut into 1–inch cubes",
    "1 tablespoon olive oil",
    "1 teaspoon onion powder",
    "1 teaspoon garlic powder",
    "1/2 teaspoon sweet paprika",
    "2 teaspoons dried Italian seasoning",
    "1 teaspoon kosher salt",
    "1/4 teaspoon cracked black pepper"
  ],
  "Instructions": [
    "Peel, deseed, and cut the squash into 1-inch cubes. You can skip the step and use pre-cut butternut squash cubes.",
    "In a medium bowl add the butternut squash cubes. Toss the squash with olive oil.",
    "In a small bowl, combine the onion powder, garlic powder, paprika, Italian seasoning, salt, and pepper.  Stir until combined and toss with the butternut squash.",
    "Add the coated squash to the air fryer basket in a single layer then close the basket.",
    "Cook the butternut squash at 400° Fahrenheit for 18-20 minutes.  Shake the basket and toss the squash around halfway through the cooking process. Cook until the squash is golden and tender to your liking.",
    "Season with additional salt and pepper if needed then garnish with fresh parsley if desired."
  ],
  "Nutrition": [
    "Calories: 51kcal",
    "Carbohydrates: 9g",
    "Protein: 1g",
    "Fat: 2g",
    "Saturated Fat: 0.3g",
    "Polyunsaturated Fat: 0.2g",
    "Monounsaturated Fat: 1g",
    "Sodium: 294mg",
    "Potassium: 263mg",
    "Fiber: 2g",
    "Sugar: 2g",
    "Vitamin A: 7511IU",
    "Vitamin C: 15mg",
    "Calcium: 44mg",
    "Iron: 1mg",
    ""
  ],
  "Comments": [
    "Millie Carter says:Do you have a recipe for the sweet version?",
    "Alyssa Rivers says:I don’t right now but you can adjust this one however you would like!",
    "Marcia says:Could this be made with frozen butternut squash?",
    "Alyssa Rivers says:Yes! The cooking time may vary so I would keep a close eye on it as it cooks!",
    "Kelly says:Looks delicious..Could I use frozen squash? I find the fresh squash too tough for me to cut.",
    "Alyssa Rivers says:Yes, you can!"
  ]
}