{
  "URL": "https://therecipecritic.com/air-fryer-avocado-egg-rolls/",
  "Summary": "Whether it is for a party or for your own private dinner, Avocado Egg Rolls in an air fryer are the appetizers to make. Crispy and golden on the outside, creamy and decadent on the inside. You have to try these!",
  "Metadata": [
    "Prep Time:  10minutes",
    "Cook Time:  12minutes",
    "Total Time:  22minutes",
    "Servings:  8Egg Rolls"
  ],
  "Ingredients": [
    "3 avocados diced",
    "1/4 cup red onion diced",
    "1 Roma tomato diced",
    "3 tbsp chopped fresh cilantro leaves",
    "1 teaspoon garlic powder",
    "Juice of 1 lime",
    "salt and pepper to taste",
    "8 egg roll wrappers",
    "olive oil spray"
  ],
  "Instructions": [
    "In a medium bowl, add the avocado and mash to desired consistency. Add the onion, tomato, cilantro, garlic powder, lime juice and salt and pepper to taste.",
    "Place the avocado mixture in the center of each wrapper. Using your finger, rub the edges with water. Bring the bottom edge of the wrapper and roll it tightly over the filling. Fold in the sides and continue to roll up the wrapper and press to seal. Repeat until you have used all of the wrappers.",
    "Spray the basket of the air fryer with olive oil spray.  Place the egg rolls in the basket and lightly spray the tops of the egg rolls with the olive oil spray.  Cook at 400 degrees for 6 minutes.  Then flip the egg rolls and cook for an additional 6 minutes."
  ],
  "Nutrition": [
    "Calories: 163kcal",
    "Carbohydrates: 15g",
    "Protein: 3g",
    "Fat: 11g",
    "Saturated Fat: 2g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 7g",
    "Cholesterol: 1mg",
    "Sodium: 81mg",
    "Potassium: 407mg",
    "Fiber: 5g",
    "Sugar: 1g",
    "Vitamin A: 187IU",
    "Vitamin C: 9mg",
    "Calcium: 17mg",
    "Iron: 1mg"
  ],
  "Comments": [
    "Christine M Houston says:What is the serving size for Nutritional Information?",
    "Alyssa Rivers says:Per egg roll. The recipe makes 8. Hope that helps!!",
    "Maria says:ThisWrappers? recipe looks delicious but I have celiac and wondered if you have a recipe for gluten free egg roll wrappers or a substitute?Thank you!",
    "Yevette Anthony says:Hi. First I love your recipes.  I don’t own  air fryer. Could you deep fry the egg rolls instead?",
    "Alyssa Rivers says:Of course! Check out the deep-fried version here.",
    "Lilianne Blondeau says:We don’t see the nutrition.",
    "Alyssa Rivers says:It’s at the bottom of the recipe card!",
    "Lilianne Blondeau says:Thank you, it wasn’t there when I was looking at te recipe.",
    "Ann says:can you freeze these and reheat?",
    "Alyssa Rivers says:Yes, this will be great! Reheat in the air fryer frozen.",
    "Beth says:These were so delicious! Everyone loved them! The only reason I gave a 4 star is because it doesn’t give the amount of mixture to put in each egg roll wrap. I ended up putting too much in and every roll split open while cooking. Although, it didn’t change the taste, they could have looked more appetizing if less mixture was in the wraps and they didn’t split open. 🙂",
    "English Saddles says:I Tried Avocado Egg Rolls And They Are Delicious, But I Don’t Like The Pre-prepared Roll Sheets Buying From Market. Do You Have A Recipe To Make Them At Home?"
  ]
}