{
  "URL": "https://therecipecritic.com/air-fryer-baked-potatoes/",
  "Summary": "Perfect Air Fryer Baked Potatoes are crispy on the outside and tender fluffy on the inside. Perfect addition to any meal, or a meal all on it's own!",
  "Metadata": [
    "Prep Time:  5minutes",
    "Cook Time:  40minutes",
    "Total Time:  45minutes",
    "Servings:  2Potatoes"
  ],
  "Ingredients": [
    "2 medium-sized potatoes",
    "1 tablespoon olive oil",
    "salt to taste"
  ],
  "Instructions": [
    "Scrub and wash the 2 medium-sized potatoes and pat dry. Rub with 1 tablespoon olive oil and pierce all over with a fork.  Place into the basket of the air fryer and sprinkle with salt to taste.",
    "Cook at 400 degrees Fahrenheit for 40 minutes or until fork tender when pierced.",
    "Cut the cooked potatoes open, fill with toppings of choice, and serve!"
  ],
  "Nutrition": [
    "Calories: 226kcal",
    "Carbohydrates: 37g",
    "Protein: 4g",
    "Fat: 7g",
    "Saturated Fat: 1g",
    "Polyunsaturated Fat: 1g",
    "Monounsaturated Fat: 5g",
    "Sodium: 13mg",
    "Potassium: 897mg",
    "Fiber: 5g",
    "Sugar: 2g",
    "Vitamin A: 4IU",
    "Vitamin C: 42mg",
    "Calcium: 26mg",
    "Iron: 2mg",
    ""
  ],
  "Comments": [
    "simon jardine says:just so happens I picked up a couple of fist sized `taters y`day for just this thing, I`ve never considered cooking them in an air fryer to achieve a baked potato, but, since I have one, & it cooks food so cleanly, I`m gonna give this a go!",
    "Tara C says:I made this tonight and followed the recipe exactly except I turned the baked potatoes over about 1/2 way through and season with salt & pepper in the outside. The skin was perfectly crispy and the potato was cooked evenly all the way through. We will be making these again for sure. Quick, easy & delicious!",
    "Jennifer Reidy says:We LOVE eating good steaks with awesome baked potatoes! My husband is so so picky about good baked potatoes so we will have to try this one with our steaks next time! These look so good and I love the way the skins turned out! Thank you!",
    "Jeannie Norris says:Taters look scrumptious."
  ]
}