{
  "URL": "https://therecipecritic.com/air-fryer-cheesecake/",
  "Summary": "Get ready to indulge in the tastiest and easiest cheesecake you'll ever make! My air fryer never fails to impress- this amazing dessert is another great recipe to add to the list! When you're craving something sweet, air fryer cheesecake requires minimal effort and time, and is a great way to impress your guests or treat yourself to something special.",
  "Metadata": [
    "Prep Time:  25minutes",
    "Cook Time:  1hour",
    "Chill Time:  4hours",
    "Total Time:    5hours25minutes",
    "Servings:  6People"
  ],
  "Ingredients": [
    "¾ cup graham cracker crumbs",
    "2 tablespoons granulated sugar",
    "2 tablespoons butter melted",
    "A dash of salt",
    "16 ounces cream cheese softened",
    "½ cup sour cream",
    "¾ cup granulated sugar",
    "2 large eggs room temperature",
    "1 teaspoon lemon zest",
    "1 teaspoon vanilla extract"
  ],
  "Instructions": [
    "Grease a 6-7 inch springform pan with cooking spray. Place a parchment round in the bottom.",
    "Combine the graham cracker crumbs with the melted butter and salt until it resembles wet sand. Press into the bottom of the pan, use your fingers or a flat-bottomed glass or measuring cup to press it in. If you’re using a 6-inch pan you may omit a tablespoon or two of the crust if desired.",
    "Bake in the airfryer at 275 degrees fahrenheit for 10 minutes. Let cool completely.",
    "Use a stand mixer or hand mixer to beat the softened cream cheese and sour cream until smooth. Add the sugar and beat again until combined, scraping down the sides and bottom of the bowl as needed.",
    "Add the eggs one at a time, mixing each one just until incorporated. Add the lemon zest and vanilla and beat until combined and smooth.",
    "Pour the batter over the cooled crust and bake at 285 degrees fahrenheit for 30 minutes. After 30 minutes, bake at 250 degrees fahrenheit for 15-20 minutes more, until the cheesecake is set but still has a little wobble to it.",
    "Crack open the airfryer and leave the cheesecake inside for 30-60 minutes, until the airfryer has cooled.",
    "Chill the cheesecake in the fridge for 4 hours or overnight before removing from the pan and serving."
  ],
  "Nutrition": [
    "Calories: 515kcal",
    "Carbohydrates: 42g",
    "Protein: 8g",
    "Fat: 36g",
    "Saturated Fat: 20g",
    "Polyunsaturated Fat: 2g",
    "Monounsaturated Fat: 10g",
    "Trans Fat: 0.2g",
    "Cholesterol: 152mg",
    "Sodium: 364mg",
    "Potassium: 166mg",
    "Fiber: 0.4g",
    "Sugar: 35g",
    "Vitamin A: 1331IU",
    "Vitamin C: 1mg",
    "Calcium: 111mg",
    "Iron: 1mg",
    ""
  ],
  "Comments": []
}